feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxDma_reg.h
/** \brief  22B4, DMA Channel Configuration Register */
#define DMA_CH21_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00122B4u)

/** Alias (User Manual Name) for DMA_CH21_CHCFGR.
* To use register names with standard convension, please use DMA_CH21_CHCFGR.
*/
#define	DMA_CHCFGR021	(DMA_CH21_CHCFGR)

/** \brief  22BC, DMARAM Channel Control and Status Register */
#define DMA_CH21_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00122BCu)

/** Alias (User Manual Name) for DMA_CH21_CHCSR.
* To use register names with standard convension, please use DMA_CH21_CHCSR.
*/
#define	DMA_CHCSR021	(DMA_CH21_CHCSR)

/** \brief  22AC, DMA Channel Destination Address Register x */
#define DMA_CH21_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00122ACu)

/** Alias (User Manual Name) for DMA_CH21_DADR.
* To use register names with standard convension, please use DMA_CH21_DADR.
*/
#define	DMA_DADR021	(DMA_CH21_DADR)

/** \brief  22A0, DMA Channel Read Data CRC Register */
#define DMA_CH21_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00122A0u)

/** Alias (User Manual Name) for DMA_CH21_RDCRCR.
* To use register names with standard convension, please use DMA_CH21_RDCRCR.
*/
#define	DMA_RDCRCR021	(DMA_CH21_RDCRCR)

/** \brief  22A8, DMA Channel Source Address Register */
#define DMA_CH21_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00122A8u)

/** Alias (User Manual Name) for DMA_CH21_SADR.
* To use register names with standard convension, please use DMA_CH21_SADR.
*/
#define	DMA_SADR021	(DMA_CH21_SADR)

/** \brief  22A4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH21_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00122A4u)

/** Alias (User Manual Name) for DMA_CH21_SDCRCR.
* To use register names with standard convension, please use DMA_CH21_SDCRCR.
*/
#define	DMA_SDCRCR021	(DMA_CH21_SDCRCR)

/** \brief  22B8, DMA Channel Shadow Address Register */
#define DMA_CH21_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00122B8u)

/** Alias (User Manual Name) for DMA_CH21_SHADR.
* To use register names with standard convension, please use DMA_CH21_SHADR.
*/
#define	DMA_SHADR021	(DMA_CH21_SHADR)

/** \brief  22D0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH22_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00122D0u)

/** Alias (User Manual Name) for DMA_CH22_ADICR.
* To use register names with standard convension, please use DMA_CH22_ADICR.
*/
#define	DMA_ADICR022	(DMA_CH22_ADICR)

/** \brief  22D4, DMA Channel Configuration Register */
#define DMA_CH22_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00122D4u)

/** Alias (User Manual Name) for DMA_CH22_CHCFGR.
* To use register names with standard convension, please use DMA_CH22_CHCFGR.
*/
#define	DMA_CHCFGR022	(DMA_CH22_CHCFGR)

/** \brief  22DC, DMARAM Channel Control and Status Register */
#define DMA_CH22_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00122DCu)

/** Alias (User Manual Name) for DMA_CH22_CHCSR.
* To use register names with standard convension, please use DMA_CH22_CHCSR.
*/
#define	DMA_CHCSR022	(DMA_CH22_CHCSR)

/** \brief  22CC, DMA Channel Destination Address Register x */
#define DMA_CH22_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00122CCu)

/** Alias (User Manual Name) for DMA_CH22_DADR.
* To use register names with standard convension, please use DMA_CH22_DADR.
*/
#define	DMA_DADR022	(DMA_CH22_DADR)

/** \brief  22C0, DMA Channel Read Data CRC Register */
#define DMA_CH22_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00122C0u)

/** Alias (User Manual Name) for DMA_CH22_RDCRCR.
* To use register names with standard convension, please use DMA_CH22_RDCRCR.
*/
#define	DMA_RDCRCR022	(DMA_CH22_RDCRCR)

/** \brief  22C8, DMA Channel Source Address Register */
#define DMA_CH22_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00122C8u)

/** Alias (User Manual Name) for DMA_CH22_SADR.
* To use register names with standard convension, please use DMA_CH22_SADR.
*/
#define	DMA_SADR022	(DMA_CH22_SADR)

/** \brief  22C4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH22_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00122C4u)

/** Alias (User Manual Name) for DMA_CH22_SDCRCR.
* To use register names with standard convension, please use DMA_CH22_SDCRCR.
*/
#define	DMA_SDCRCR022	(DMA_CH22_SDCRCR)

/** \brief  22D8, DMA Channel Shadow Address Register */
#define DMA_CH22_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00122D8u)

/** Alias (User Manual Name) for DMA_CH22_SHADR.
* To use register names with standard convension, please use DMA_CH22_SHADR.
*/
#define	DMA_SHADR022	(DMA_CH22_SHADR)

/** \brief  22F0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH23_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00122F0u)

/** Alias (User Manual Name) for DMA_CH23_ADICR.
* To use register names with standard convension, please use DMA_CH23_ADICR.
*/
#define	DMA_ADICR023	(DMA_CH23_ADICR)

/** \brief  22F4, DMA Channel Configuration Register */
#define DMA_CH23_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00122F4u)

/** Alias (User Manual Name) for DMA_CH23_CHCFGR.
* To use register names with standard convension, please use DMA_CH23_CHCFGR.
*/
#define	DMA_CHCFGR023	(DMA_CH23_CHCFGR)

/** \brief  22FC, DMARAM Channel Control and Status Register */
#define DMA_CH23_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00122FCu)

/** Alias (User Manual Name) for DMA_CH23_CHCSR.
* To use register names with standard convension, please use DMA_CH23_CHCSR.
*/
#define	DMA_CHCSR023	(DMA_CH23_CHCSR)

/** \brief  22EC, DMA Channel Destination Address Register x */
#define DMA_CH23_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00122ECu)

/** Alias (User Manual Name) for DMA_CH23_DADR.
* To use register names with standard convension, please use DMA_CH23_DADR.
*/
#define	DMA_DADR023	(DMA_CH23_DADR)

