feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxDma_reg.h
/** \brief  22E0, DMA Channel Read Data CRC Register */
#define DMA_CH23_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00122E0u)

/** Alias (User Manual Name) for DMA_CH23_RDCRCR.
* To use register names with standard convension, please use DMA_CH23_RDCRCR.
*/
#define	DMA_RDCRCR023	(DMA_CH23_RDCRCR)

/** \brief  22E8, DMA Channel Source Address Register */
#define DMA_CH23_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00122E8u)

/** Alias (User Manual Name) for DMA_CH23_SADR.
* To use register names with standard convension, please use DMA_CH23_SADR.
*/
#define	DMA_SADR023	(DMA_CH23_SADR)

/** \brief  22E4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH23_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00122E4u)

/** Alias (User Manual Name) for DMA_CH23_SDCRCR.
* To use register names with standard convension, please use DMA_CH23_SDCRCR.
*/
#define	DMA_SDCRCR023	(DMA_CH23_SDCRCR)

/** \brief  22F8, DMA Channel Shadow Address Register */
#define DMA_CH23_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00122F8u)

/** Alias (User Manual Name) for DMA_CH23_SHADR.
* To use register names with standard convension, please use DMA_CH23_SHADR.
*/
#define	DMA_SHADR023	(DMA_CH23_SHADR)

/** \brief  2310, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH24_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012310u)

/** Alias (User Manual Name) for DMA_CH24_ADICR.
* To use register names with standard convension, please use DMA_CH24_ADICR.
*/
#define	DMA_ADICR024	(DMA_CH24_ADICR)

/** \brief  2314, DMA Channel Configuration Register */
#define DMA_CH24_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012314u)

/** Alias (User Manual Name) for DMA_CH24_CHCFGR.
* To use register names with standard convension, please use DMA_CH24_CHCFGR.
*/
#define	DMA_CHCFGR024	(DMA_CH24_CHCFGR)

/** \brief  231C, DMARAM Channel Control and Status Register */
#define DMA_CH24_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001231Cu)

/** Alias (User Manual Name) for DMA_CH24_CHCSR.
* To use register names with standard convension, please use DMA_CH24_CHCSR.
*/
#define	DMA_CHCSR024	(DMA_CH24_CHCSR)

/** \brief  230C, DMA Channel Destination Address Register x */
#define DMA_CH24_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001230Cu)

/** Alias (User Manual Name) for DMA_CH24_DADR.
* To use register names with standard convension, please use DMA_CH24_DADR.
*/
#define	DMA_DADR024	(DMA_CH24_DADR)

/** \brief  2300, DMA Channel Read Data CRC Register */
#define DMA_CH24_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012300u)

/** Alias (User Manual Name) for DMA_CH24_RDCRCR.
* To use register names with standard convension, please use DMA_CH24_RDCRCR.
*/
#define	DMA_RDCRCR024	(DMA_CH24_RDCRCR)

/** \brief  2308, DMA Channel Source Address Register */
#define DMA_CH24_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012308u)

/** Alias (User Manual Name) for DMA_CH24_SADR.
* To use register names with standard convension, please use DMA_CH24_SADR.
*/
#define	DMA_SADR024	(DMA_CH24_SADR)

/** \brief  2304, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH24_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012304u)

/** Alias (User Manual Name) for DMA_CH24_SDCRCR.
* To use register names with standard convension, please use DMA_CH24_SDCRCR.
*/
#define	DMA_SDCRCR024	(DMA_CH24_SDCRCR)

/** \brief  2318, DMA Channel Shadow Address Register */
#define DMA_CH24_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012318u)

/** Alias (User Manual Name) for DMA_CH24_SHADR.
* To use register names with standard convension, please use DMA_CH24_SHADR.
*/
#define	DMA_SHADR024	(DMA_CH24_SHADR)

/** \brief  2330, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH25_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012330u)

/** Alias (User Manual Name) for DMA_CH25_ADICR.
* To use register names with standard convension, please use DMA_CH25_ADICR.
*/
#define	DMA_ADICR025	(DMA_CH25_ADICR)

/** \brief  2334, DMA Channel Configuration Register */
#define DMA_CH25_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012334u)

/** Alias (User Manual Name) for DMA_CH25_CHCFGR.
* To use register names with standard convension, please use DMA_CH25_CHCFGR.
*/
#define	DMA_CHCFGR025	(DMA_CH25_CHCFGR)

/** \brief  233C, DMARAM Channel Control and Status Register */
#define DMA_CH25_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001233Cu)

/** Alias (User Manual Name) for DMA_CH25_CHCSR.
* To use register names with standard convension, please use DMA_CH25_CHCSR.
*/
#define	DMA_CHCSR025	(DMA_CH25_CHCSR)

/** \brief  232C, DMA Channel Destination Address Register x */
#define DMA_CH25_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001232Cu)

/** Alias (User Manual Name) for DMA_CH25_DADR.
* To use register names with standard convension, please use DMA_CH25_DADR.
*/
#define	DMA_DADR025	(DMA_CH25_DADR)

/** \brief  2320, DMA Channel Read Data CRC Register */
#define DMA_CH25_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012320u)

/** Alias (User Manual Name) for DMA_CH25_RDCRCR.
* To use register names with standard convension, please use DMA_CH25_RDCRCR.
*/
#define	DMA_RDCRCR025	(DMA_CH25_RDCRCR)

/** \brief  2328, DMA Channel Source Address Register */
#define DMA_CH25_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012328u)

/** Alias (User Manual Name) for DMA_CH25_SADR.
* To use register names with standard convension, please use DMA_CH25_SADR.
*/
#define	DMA_SADR025	(DMA_CH25_SADR)

/** \brief  2324, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH25_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012324u)

/** Alias (User Manual Name) for DMA_CH25_SDCRCR.
* To use register names with standard convension, please use DMA_CH25_SDCRCR.
*/
#define	DMA_SDCRCR025	(DMA_CH25_SDCRCR)

/** \brief  2338, DMA Channel Shadow Address Register */
#define DMA_CH25_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012338u)

/** Alias (User Manual Name) for DMA_CH25_SHADR.
* To use register names with standard convension, please use DMA_CH25_SHADR.
*/
#define	DMA_SHADR025	(DMA_CH25_SHADR)

/** \brief  2350, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH26_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012350u)

/** Alias (User Manual Name) for DMA_CH26_ADICR.
* To use register names with standard convension, please use DMA_CH26_ADICR.
*/
#define	DMA_ADICR026	(DMA_CH26_ADICR)

/** \brief  2354, DMA Channel Configuration Register */
#define DMA_CH26_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012354u)

/** Alias (User Manual Name) for DMA_CH26_CHCFGR.
* To use register names with standard convension, please use DMA_CH26_CHCFGR.
*/
#define	DMA_CHCFGR026	(DMA_CH26_CHCFGR)

