feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH47_CHCSR.
* To use register names with standard convension, please use DMA_CH47_CHCSR.
*/
#define	DMA_CHCSR047	(DMA_CH47_CHCSR)

/** \brief  25EC, DMA Channel Destination Address Register x */
#define DMA_CH47_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00125ECu)

/** Alias (User Manual Name) for DMA_CH47_DADR.
* To use register names with standard convension, please use DMA_CH47_DADR.
*/
#define	DMA_DADR047	(DMA_CH47_DADR)

/** \brief  25E0, DMA Channel Read Data CRC Register */
#define DMA_CH47_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00125E0u)

/** Alias (User Manual Name) for DMA_CH47_RDCRCR.
* To use register names with standard convension, please use DMA_CH47_RDCRCR.
*/
#define	DMA_RDCRCR047	(DMA_CH47_RDCRCR)

/** \brief  25E8, DMA Channel Source Address Register */
#define DMA_CH47_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00125E8u)

/** Alias (User Manual Name) for DMA_CH47_SADR.
* To use register names with standard convension, please use DMA_CH47_SADR.
*/
#define	DMA_SADR047	(DMA_CH47_SADR)

/** \brief  25E4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH47_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00125E4u)

/** Alias (User Manual Name) for DMA_CH47_SDCRCR.
* To use register names with standard convension, please use DMA_CH47_SDCRCR.
*/
#define	DMA_SDCRCR047	(DMA_CH47_SDCRCR)

/** \brief  25F8, DMA Channel Shadow Address Register */
#define DMA_CH47_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00125F8u)

/** Alias (User Manual Name) for DMA_CH47_SHADR.
* To use register names with standard convension, please use DMA_CH47_SHADR.
*/
#define	DMA_SHADR047	(DMA_CH47_SHADR)

/** \brief  2610, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH48_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012610u)

/** Alias (User Manual Name) for DMA_CH48_ADICR.
* To use register names with standard convension, please use DMA_CH48_ADICR.
*/
#define	DMA_ADICR048	(DMA_CH48_ADICR)

/** \brief  2614, DMA Channel Configuration Register */
#define DMA_CH48_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012614u)

/** Alias (User Manual Name) for DMA_CH48_CHCFGR.
* To use register names with standard convension, please use DMA_CH48_CHCFGR.
*/
#define	DMA_CHCFGR048	(DMA_CH48_CHCFGR)

/** \brief  261C, DMARAM Channel Control and Status Register */
#define DMA_CH48_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001261Cu)

/** Alias (User Manual Name) for DMA_CH48_CHCSR.
* To use register names with standard convension, please use DMA_CH48_CHCSR.
*/
#define	DMA_CHCSR048	(DMA_CH48_CHCSR)

/** \brief  260C, DMA Channel Destination Address Register x */
#define DMA_CH48_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001260Cu)

/** Alias (User Manual Name) for DMA_CH48_DADR.
* To use register names with standard convension, please use DMA_CH48_DADR.
*/
#define	DMA_DADR048	(DMA_CH48_DADR)

/** \brief  2600, DMA Channel Read Data CRC Register */
#define DMA_CH48_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012600u)

/** Alias (User Manual Name) for DMA_CH48_RDCRCR.
* To use register names with standard convension, please use DMA_CH48_RDCRCR.
*/
#define	DMA_RDCRCR048	(DMA_CH48_RDCRCR)

/** \brief  2608, DMA Channel Source Address Register */
#define DMA_CH48_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012608u)

/** Alias (User Manual Name) for DMA_CH48_SADR.
* To use register names with standard convension, please use DMA_CH48_SADR.
*/
#define	DMA_SADR048	(DMA_CH48_SADR)

/** \brief  2604, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH48_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012604u)

/** Alias (User Manual Name) for DMA_CH48_SDCRCR.
* To use register names with standard convension, please use DMA_CH48_SDCRCR.
*/
#define	DMA_SDCRCR048	(DMA_CH48_SDCRCR)

/** \brief  2618, DMA Channel Shadow Address Register */
#define DMA_CH48_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012618u)

/** Alias (User Manual Name) for DMA_CH48_SHADR.
* To use register names with standard convension, please use DMA_CH48_SHADR.
*/
#define	DMA_SHADR048	(DMA_CH48_SHADR)

/** \brief  2630, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH49_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012630u)

/** Alias (User Manual Name) for DMA_CH49_ADICR.
* To use register names with standard convension, please use DMA_CH49_ADICR.
*/
#define	DMA_ADICR049	(DMA_CH49_ADICR)

/** \brief  2634, DMA Channel Configuration Register */
#define DMA_CH49_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012634u)

/** Alias (User Manual Name) for DMA_CH49_CHCFGR.
* To use register names with standard convension, please use DMA_CH49_CHCFGR.
*/
#define	DMA_CHCFGR049	(DMA_CH49_CHCFGR)

/** \brief  263C, DMARAM Channel Control and Status Register */
#define DMA_CH49_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001263Cu)

/** Alias (User Manual Name) for DMA_CH49_CHCSR.
* To use register names with standard convension, please use DMA_CH49_CHCSR.
*/
#define	DMA_CHCSR049	(DMA_CH49_CHCSR)

/** \brief  262C, DMA Channel Destination Address Register x */
#define DMA_CH49_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001262Cu)

/** Alias (User Manual Name) for DMA_CH49_DADR.
* To use register names with standard convension, please use DMA_CH49_DADR.
*/
#define	DMA_DADR049	(DMA_CH49_DADR)

/** \brief  2620, DMA Channel Read Data CRC Register */
#define DMA_CH49_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012620u)

/** Alias (User Manual Name) for DMA_CH49_RDCRCR.
* To use register names with standard convension, please use DMA_CH49_RDCRCR.
*/
#define	DMA_RDCRCR049	(DMA_CH49_RDCRCR)

/** \brief  2628, DMA Channel Source Address Register */
#define DMA_CH49_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012628u)

/** Alias (User Manual Name) for DMA_CH49_SADR.
* To use register names with standard convension, please use DMA_CH49_SADR.
*/
#define	DMA_SADR049	(DMA_CH49_SADR)

/** \brief  2624, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH49_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012624u)

