feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH51_CHCSR.
* To use register names with standard convension, please use DMA_CH51_CHCSR.
*/
#define	DMA_CHCSR051	(DMA_CH51_CHCSR)

/** \brief  266C, DMA Channel Destination Address Register x */
#define DMA_CH51_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001266Cu)

/** Alias (User Manual Name) for DMA_CH51_DADR.
* To use register names with standard convension, please use DMA_CH51_DADR.
*/
#define	DMA_DADR051	(DMA_CH51_DADR)

/** \brief  2660, DMA Channel Read Data CRC Register */
#define DMA_CH51_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012660u)

/** Alias (User Manual Name) for DMA_CH51_RDCRCR.
* To use register names with standard convension, please use DMA_CH51_RDCRCR.
*/
#define	DMA_RDCRCR051	(DMA_CH51_RDCRCR)

/** \brief  2668, DMA Channel Source Address Register */
#define DMA_CH51_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012668u)

/** Alias (User Manual Name) for DMA_CH51_SADR.
* To use register names with standard convension, please use DMA_CH51_SADR.
*/
#define	DMA_SADR051	(DMA_CH51_SADR)

/** \brief  2664, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH51_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012664u)

/** Alias (User Manual Name) for DMA_CH51_SDCRCR.
* To use register names with standard convension, please use DMA_CH51_SDCRCR.
*/
#define	DMA_SDCRCR051	(DMA_CH51_SDCRCR)

/** \brief  2678, DMA Channel Shadow Address Register */
#define DMA_CH51_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012678u)

/** Alias (User Manual Name) for DMA_CH51_SHADR.
* To use register names with standard convension, please use DMA_CH51_SHADR.
*/
#define	DMA_SHADR051	(DMA_CH51_SHADR)

/** \brief  2690, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH52_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012690u)

/** Alias (User Manual Name) for DMA_CH52_ADICR.
* To use register names with standard convension, please use DMA_CH52_ADICR.
*/
#define	DMA_ADICR052	(DMA_CH52_ADICR)

/** \brief  2694, DMA Channel Configuration Register */
#define DMA_CH52_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012694u)

/** Alias (User Manual Name) for DMA_CH52_CHCFGR.
* To use register names with standard convension, please use DMA_CH52_CHCFGR.
*/
#define	DMA_CHCFGR052	(DMA_CH52_CHCFGR)

/** \brief  269C, DMARAM Channel Control and Status Register */
#define DMA_CH52_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001269Cu)

/** Alias (User Manual Name) for DMA_CH52_CHCSR.
* To use register names with standard convension, please use DMA_CH52_CHCSR.
*/
#define	DMA_CHCSR052	(DMA_CH52_CHCSR)

/** \brief  268C, DMA Channel Destination Address Register x */
#define DMA_CH52_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001268Cu)

/** Alias (User Manual Name) for DMA_CH52_DADR.
* To use register names with standard convension, please use DMA_CH52_DADR.
*/
#define	DMA_DADR052	(DMA_CH52_DADR)

/** \brief  2680, DMA Channel Read Data CRC Register */
#define DMA_CH52_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012680u)

/** Alias (User Manual Name) for DMA_CH52_RDCRCR.
* To use register names with standard convension, please use DMA_CH52_RDCRCR.
*/
#define	DMA_RDCRCR052	(DMA_CH52_RDCRCR)

/** \brief  2688, DMA Channel Source Address Register */
#define DMA_CH52_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012688u)

/** Alias (User Manual Name) for DMA_CH52_SADR.
* To use register names with standard convension, please use DMA_CH52_SADR.
*/
#define	DMA_SADR052	(DMA_CH52_SADR)

/** \brief  2684, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH52_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012684u)

/** Alias (User Manual Name) for DMA_CH52_SDCRCR.
* To use register names with standard convension, please use DMA_CH52_SDCRCR.
*/
#define	DMA_SDCRCR052	(DMA_CH52_SDCRCR)

/** \brief  2698, DMA Channel Shadow Address Register */
#define DMA_CH52_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012698u)

/** Alias (User Manual Name) for DMA_CH52_SHADR.
* To use register names with standard convension, please use DMA_CH52_SHADR.
*/
#define	DMA_SHADR052	(DMA_CH52_SHADR)

/** \brief  26B0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH53_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00126B0u)

/** Alias (User Manual Name) for DMA_CH53_ADICR.
* To use register names with standard convension, please use DMA_CH53_ADICR.
*/
#define	DMA_ADICR053	(DMA_CH53_ADICR)

/** \brief  26B4, DMA Channel Configuration Register */
#define DMA_CH53_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00126B4u)

/** Alias (User Manual Name) for DMA_CH53_CHCFGR.
* To use register names with standard convension, please use DMA_CH53_CHCFGR.
*/
#define	DMA_CHCFGR053	(DMA_CH53_CHCFGR)

/** \brief  26BC, DMARAM Channel Control and Status Register */
#define DMA_CH53_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00126BCu)

/** Alias (User Manual Name) for DMA_CH53_CHCSR.
* To use register names with standard convension, please use DMA_CH53_CHCSR.
*/
#define	DMA_CHCSR053	(DMA_CH53_CHCSR)

/** \brief  26AC, DMA Channel Destination Address Register x */
#define DMA_CH53_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00126ACu)

/** Alias (User Manual Name) for DMA_CH53_DADR.
* To use register names with standard convension, please use DMA_CH53_DADR.
*/
#define	DMA_DADR053	(DMA_CH53_DADR)

/** \brief  26A0, DMA Channel Read Data CRC Register */
#define DMA_CH53_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00126A0u)

/** Alias (User Manual Name) for DMA_CH53_RDCRCR.
* To use register names with standard convension, please use DMA_CH53_RDCRCR.
*/
#define	DMA_RDCRCR053	(DMA_CH53_RDCRCR)

/** \brief  26A8, DMA Channel Source Address Register */
#define DMA_CH53_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00126A8u)

/** Alias (User Manual Name) for DMA_CH53_SADR.
* To use register names with standard convension, please use DMA_CH53_SADR.
*/
#define	DMA_SADR053	(DMA_CH53_SADR)

