feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxDma_reg.h
/** \brief  26A4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH53_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00126A4u)

/** Alias (User Manual Name) for DMA_CH53_SDCRCR.
* To use register names with standard convension, please use DMA_CH53_SDCRCR.
*/
#define	DMA_SDCRCR053	(DMA_CH53_SDCRCR)

/** \brief  26B8, DMA Channel Shadow Address Register */
#define DMA_CH53_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00126B8u)

/** Alias (User Manual Name) for DMA_CH53_SHADR.
* To use register names with standard convension, please use DMA_CH53_SHADR.
*/
#define	DMA_SHADR053	(DMA_CH53_SHADR)

/** \brief  26D0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH54_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00126D0u)

/** Alias (User Manual Name) for DMA_CH54_ADICR.
* To use register names with standard convension, please use DMA_CH54_ADICR.
*/
#define	DMA_ADICR054	(DMA_CH54_ADICR)

/** \brief  26D4, DMA Channel Configuration Register */
#define DMA_CH54_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00126D4u)

/** Alias (User Manual Name) for DMA_CH54_CHCFGR.
* To use register names with standard convension, please use DMA_CH54_CHCFGR.
*/
#define	DMA_CHCFGR054	(DMA_CH54_CHCFGR)

/** \brief  26DC, DMARAM Channel Control and Status Register */
#define DMA_CH54_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00126DCu)

/** Alias (User Manual Name) for DMA_CH54_CHCSR.
* To use register names with standard convension, please use DMA_CH54_CHCSR.
*/
#define	DMA_CHCSR054	(DMA_CH54_CHCSR)

/** \brief  26CC, DMA Channel Destination Address Register x */
#define DMA_CH54_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00126CCu)

/** Alias (User Manual Name) for DMA_CH54_DADR.
* To use register names with standard convension, please use DMA_CH54_DADR.
*/
#define	DMA_DADR054	(DMA_CH54_DADR)

/** \brief  26C0, DMA Channel Read Data CRC Register */
#define DMA_CH54_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00126C0u)

/** Alias (User Manual Name) for DMA_CH54_RDCRCR.
* To use register names with standard convension, please use DMA_CH54_RDCRCR.
*/
#define	DMA_RDCRCR054	(DMA_CH54_RDCRCR)

/** \brief  26C8, DMA Channel Source Address Register */
#define DMA_CH54_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00126C8u)

/** Alias (User Manual Name) for DMA_CH54_SADR.
* To use register names with standard convension, please use DMA_CH54_SADR.
*/
#define	DMA_SADR054	(DMA_CH54_SADR)

/** \brief  26C4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH54_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00126C4u)

/** Alias (User Manual Name) for DMA_CH54_SDCRCR.
* To use register names with standard convension, please use DMA_CH54_SDCRCR.
*/
#define	DMA_SDCRCR054	(DMA_CH54_SDCRCR)

/** \brief  26D8, DMA Channel Shadow Address Register */
#define DMA_CH54_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00126D8u)

/** Alias (User Manual Name) for DMA_CH54_SHADR.
* To use register names with standard convension, please use DMA_CH54_SHADR.
*/
#define	DMA_SHADR054	(DMA_CH54_SHADR)

/** \brief  26F0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH55_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00126F0u)

/** Alias (User Manual Name) for DMA_CH55_ADICR.
* To use register names with standard convension, please use DMA_CH55_ADICR.
*/
#define	DMA_ADICR055	(DMA_CH55_ADICR)

/** \brief  26F4, DMA Channel Configuration Register */
#define DMA_CH55_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00126F4u)

/** Alias (User Manual Name) for DMA_CH55_CHCFGR.
* To use register names with standard convension, please use DMA_CH55_CHCFGR.
*/
#define	DMA_CHCFGR055	(DMA_CH55_CHCFGR)

/** \brief  26FC, DMARAM Channel Control and Status Register */
#define DMA_CH55_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00126FCu)

/** Alias (User Manual Name) for DMA_CH55_CHCSR.
* To use register names with standard convension, please use DMA_CH55_CHCSR.
*/
#define	DMA_CHCSR055	(DMA_CH55_CHCSR)

/** \brief  26EC, DMA Channel Destination Address Register x */
#define DMA_CH55_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00126ECu)

/** Alias (User Manual Name) for DMA_CH55_DADR.
* To use register names with standard convension, please use DMA_CH55_DADR.
*/
#define	DMA_DADR055	(DMA_CH55_DADR)

/** \brief  26E0, DMA Channel Read Data CRC Register */
#define DMA_CH55_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00126E0u)

/** Alias (User Manual Name) for DMA_CH55_RDCRCR.
* To use register names with standard convension, please use DMA_CH55_RDCRCR.
*/
#define	DMA_RDCRCR055	(DMA_CH55_RDCRCR)

/** \brief  26E8, DMA Channel Source Address Register */
#define DMA_CH55_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00126E8u)

/** Alias (User Manual Name) for DMA_CH55_SADR.
* To use register names with standard convension, please use DMA_CH55_SADR.
*/
#define	DMA_SADR055	(DMA_CH55_SADR)

/** \brief  26E4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH55_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00126E4u)

/** Alias (User Manual Name) for DMA_CH55_SDCRCR.
* To use register names with standard convension, please use DMA_CH55_SDCRCR.
*/
#define	DMA_SDCRCR055	(DMA_CH55_SDCRCR)

/** \brief  26F8, DMA Channel Shadow Address Register */
#define DMA_CH55_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00126F8u)

/** Alias (User Manual Name) for DMA_CH55_SHADR.
* To use register names with standard convension, please use DMA_CH55_SHADR.
*/
#define	DMA_SHADR055	(DMA_CH55_SHADR)

/** \brief  2710, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH56_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012710u)

/** Alias (User Manual Name) for DMA_CH56_ADICR.
* To use register names with standard convension, please use DMA_CH56_ADICR.
*/
#define	DMA_ADICR056	(DMA_CH56_ADICR)

/** \brief  2714, DMA Channel Configuration Register */
#define DMA_CH56_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012714u)

/** Alias (User Manual Name) for DMA_CH56_CHCFGR.
* To use register names with standard convension, please use DMA_CH56_CHCFGR.
*/
#define	DMA_CHCFGR056	(DMA_CH56_CHCFGR)

