feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxDma_reg.h
/** \brief  271C, DMARAM Channel Control and Status Register */
#define DMA_CH56_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001271Cu)

/** Alias (User Manual Name) for DMA_CH56_CHCSR.
* To use register names with standard convension, please use DMA_CH56_CHCSR.
*/
#define	DMA_CHCSR056	(DMA_CH56_CHCSR)

/** \brief  270C, DMA Channel Destination Address Register x */
#define DMA_CH56_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001270Cu)

/** Alias (User Manual Name) for DMA_CH56_DADR.
* To use register names with standard convension, please use DMA_CH56_DADR.
*/
#define	DMA_DADR056	(DMA_CH56_DADR)

/** \brief  2700, DMA Channel Read Data CRC Register */
#define DMA_CH56_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012700u)

/** Alias (User Manual Name) for DMA_CH56_RDCRCR.
* To use register names with standard convension, please use DMA_CH56_RDCRCR.
*/
#define	DMA_RDCRCR056	(DMA_CH56_RDCRCR)

/** \brief  2708, DMA Channel Source Address Register */
#define DMA_CH56_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012708u)

/** Alias (User Manual Name) for DMA_CH56_SADR.
* To use register names with standard convension, please use DMA_CH56_SADR.
*/
#define	DMA_SADR056	(DMA_CH56_SADR)

/** \brief  2704, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH56_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012704u)

/** Alias (User Manual Name) for DMA_CH56_SDCRCR.
* To use register names with standard convension, please use DMA_CH56_SDCRCR.
*/
#define	DMA_SDCRCR056	(DMA_CH56_SDCRCR)

/** \brief  2718, DMA Channel Shadow Address Register */
#define DMA_CH56_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012718u)

/** Alias (User Manual Name) for DMA_CH56_SHADR.
* To use register names with standard convension, please use DMA_CH56_SHADR.
*/
#define	DMA_SHADR056	(DMA_CH56_SHADR)

/** \brief  2730, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH57_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012730u)

/** Alias (User Manual Name) for DMA_CH57_ADICR.
* To use register names with standard convension, please use DMA_CH57_ADICR.
*/
#define	DMA_ADICR057	(DMA_CH57_ADICR)

/** \brief  2734, DMA Channel Configuration Register */
#define DMA_CH57_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012734u)

/** Alias (User Manual Name) for DMA_CH57_CHCFGR.
* To use register names with standard convension, please use DMA_CH57_CHCFGR.
*/
#define	DMA_CHCFGR057	(DMA_CH57_CHCFGR)

/** \brief  273C, DMARAM Channel Control and Status Register */
#define DMA_CH57_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001273Cu)

/** Alias (User Manual Name) for DMA_CH57_CHCSR.
* To use register names with standard convension, please use DMA_CH57_CHCSR.
*/
#define	DMA_CHCSR057	(DMA_CH57_CHCSR)

/** \brief  272C, DMA Channel Destination Address Register x */
#define DMA_CH57_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001272Cu)

/** Alias (User Manual Name) for DMA_CH57_DADR.
* To use register names with standard convension, please use DMA_CH57_DADR.
*/
#define	DMA_DADR057	(DMA_CH57_DADR)

/** \brief  2720, DMA Channel Read Data CRC Register */
#define DMA_CH57_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012720u)

/** Alias (User Manual Name) for DMA_CH57_RDCRCR.
* To use register names with standard convension, please use DMA_CH57_RDCRCR.
*/
#define	DMA_RDCRCR057	(DMA_CH57_RDCRCR)

/** \brief  2728, DMA Channel Source Address Register */
#define DMA_CH57_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012728u)

/** Alias (User Manual Name) for DMA_CH57_SADR.
* To use register names with standard convension, please use DMA_CH57_SADR.
*/
#define	DMA_SADR057	(DMA_CH57_SADR)

/** \brief  2724, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH57_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012724u)

/** Alias (User Manual Name) for DMA_CH57_SDCRCR.
* To use register names with standard convension, please use DMA_CH57_SDCRCR.
*/
#define	DMA_SDCRCR057	(DMA_CH57_SDCRCR)

/** \brief  2738, DMA Channel Shadow Address Register */
#define DMA_CH57_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012738u)

/** Alias (User Manual Name) for DMA_CH57_SHADR.
* To use register names with standard convension, please use DMA_CH57_SHADR.
*/
#define	DMA_SHADR057	(DMA_CH57_SHADR)

/** \brief  2750, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH58_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012750u)

/** Alias (User Manual Name) for DMA_CH58_ADICR.
* To use register names with standard convension, please use DMA_CH58_ADICR.
*/
#define	DMA_ADICR058	(DMA_CH58_ADICR)

/** \brief  2754, DMA Channel Configuration Register */
#define DMA_CH58_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012754u)

/** Alias (User Manual Name) for DMA_CH58_CHCFGR.
* To use register names with standard convension, please use DMA_CH58_CHCFGR.
*/
#define	DMA_CHCFGR058	(DMA_CH58_CHCFGR)

/** \brief  275C, DMARAM Channel Control and Status Register */
#define DMA_CH58_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001275Cu)

/** Alias (User Manual Name) for DMA_CH58_CHCSR.
* To use register names with standard convension, please use DMA_CH58_CHCSR.
*/
#define	DMA_CHCSR058	(DMA_CH58_CHCSR)

/** \brief  274C, DMA Channel Destination Address Register x */
#define DMA_CH58_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001274Cu)

/** Alias (User Manual Name) for DMA_CH58_DADR.
* To use register names with standard convension, please use DMA_CH58_DADR.
*/
#define	DMA_DADR058	(DMA_CH58_DADR)

/** \brief  2740, DMA Channel Read Data CRC Register */
#define DMA_CH58_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012740u)

/** Alias (User Manual Name) for DMA_CH58_RDCRCR.
* To use register names with standard convension, please use DMA_CH58_RDCRCR.
*/
#define	DMA_RDCRCR058	(DMA_CH58_RDCRCR)

/** \brief  2748, DMA Channel Source Address Register */
#define DMA_CH58_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012748u)

/** Alias (User Manual Name) for DMA_CH58_SADR.
* To use register names with standard convension, please use DMA_CH58_SADR.
*/
#define	DMA_SADR058	(DMA_CH58_SADR)

