feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxDma_reg.h
/** \brief  2784, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH60_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012784u)

/** Alias (User Manual Name) for DMA_CH60_SDCRCR.
* To use register names with standard convension, please use DMA_CH60_SDCRCR.
*/
#define	DMA_SDCRCR060	(DMA_CH60_SDCRCR)

/** \brief  2798, DMA Channel Shadow Address Register */
#define DMA_CH60_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012798u)

/** Alias (User Manual Name) for DMA_CH60_SHADR.
* To use register names with standard convension, please use DMA_CH60_SHADR.
*/
#define	DMA_SHADR060	(DMA_CH60_SHADR)

/** \brief  27B0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH61_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00127B0u)

/** Alias (User Manual Name) for DMA_CH61_ADICR.
* To use register names with standard convension, please use DMA_CH61_ADICR.
*/
#define	DMA_ADICR061	(DMA_CH61_ADICR)

/** \brief  27B4, DMA Channel Configuration Register */
#define DMA_CH61_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00127B4u)

/** Alias (User Manual Name) for DMA_CH61_CHCFGR.
* To use register names with standard convension, please use DMA_CH61_CHCFGR.
*/
#define	DMA_CHCFGR061	(DMA_CH61_CHCFGR)

/** \brief  27BC, DMARAM Channel Control and Status Register */
#define DMA_CH61_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00127BCu)

/** Alias (User Manual Name) for DMA_CH61_CHCSR.
* To use register names with standard convension, please use DMA_CH61_CHCSR.
*/
#define	DMA_CHCSR061	(DMA_CH61_CHCSR)

/** \brief  27AC, DMA Channel Destination Address Register x */
#define DMA_CH61_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00127ACu)

/** Alias (User Manual Name) for DMA_CH61_DADR.
* To use register names with standard convension, please use DMA_CH61_DADR.
*/
#define	DMA_DADR061	(DMA_CH61_DADR)

/** \brief  27A0, DMA Channel Read Data CRC Register */
#define DMA_CH61_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00127A0u)

/** Alias (User Manual Name) for DMA_CH61_RDCRCR.
* To use register names with standard convension, please use DMA_CH61_RDCRCR.
*/
#define	DMA_RDCRCR061	(DMA_CH61_RDCRCR)

/** \brief  27A8, DMA Channel Source Address Register */
#define DMA_CH61_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00127A8u)

/** Alias (User Manual Name) for DMA_CH61_SADR.
* To use register names with standard convension, please use DMA_CH61_SADR.
*/
#define	DMA_SADR061	(DMA_CH61_SADR)

/** \brief  27A4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH61_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00127A4u)

/** Alias (User Manual Name) for DMA_CH61_SDCRCR.
* To use register names with standard convension, please use DMA_CH61_SDCRCR.
*/
#define	DMA_SDCRCR061	(DMA_CH61_SDCRCR)

/** \brief  27B8, DMA Channel Shadow Address Register */
#define DMA_CH61_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00127B8u)

/** Alias (User Manual Name) for DMA_CH61_SHADR.
* To use register names with standard convension, please use DMA_CH61_SHADR.
*/
#define	DMA_SHADR061	(DMA_CH61_SHADR)

/** \brief  27D0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH62_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00127D0u)

/** Alias (User Manual Name) for DMA_CH62_ADICR.
* To use register names with standard convension, please use DMA_CH62_ADICR.
*/
#define	DMA_ADICR062	(DMA_CH62_ADICR)

/** \brief  27D4, DMA Channel Configuration Register */
#define DMA_CH62_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00127D4u)

/** Alias (User Manual Name) for DMA_CH62_CHCFGR.
* To use register names with standard convension, please use DMA_CH62_CHCFGR.
*/
#define	DMA_CHCFGR062	(DMA_CH62_CHCFGR)

/** \brief  27DC, DMARAM Channel Control and Status Register */
#define DMA_CH62_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00127DCu)

/** Alias (User Manual Name) for DMA_CH62_CHCSR.
* To use register names with standard convension, please use DMA_CH62_CHCSR.
*/
#define	DMA_CHCSR062	(DMA_CH62_CHCSR)

/** \brief  27CC, DMA Channel Destination Address Register x */
#define DMA_CH62_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00127CCu)

/** Alias (User Manual Name) for DMA_CH62_DADR.
* To use register names with standard convension, please use DMA_CH62_DADR.
*/
#define	DMA_DADR062	(DMA_CH62_DADR)

/** \brief  27C0, DMA Channel Read Data CRC Register */
#define DMA_CH62_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00127C0u)

/** Alias (User Manual Name) for DMA_CH62_RDCRCR.
* To use register names with standard convension, please use DMA_CH62_RDCRCR.
*/
#define	DMA_RDCRCR062	(DMA_CH62_RDCRCR)

/** \brief  27C8, DMA Channel Source Address Register */
#define DMA_CH62_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00127C8u)

/** Alias (User Manual Name) for DMA_CH62_SADR.
* To use register names with standard convension, please use DMA_CH62_SADR.
*/
#define	DMA_SADR062	(DMA_CH62_SADR)

/** \brief  27C4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH62_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00127C4u)

/** Alias (User Manual Name) for DMA_CH62_SDCRCR.
* To use register names with standard convension, please use DMA_CH62_SDCRCR.
*/
#define	DMA_SDCRCR062	(DMA_CH62_SDCRCR)

/** \brief  27D8, DMA Channel Shadow Address Register */
#define DMA_CH62_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00127D8u)

/** Alias (User Manual Name) for DMA_CH62_SHADR.
* To use register names with standard convension, please use DMA_CH62_SHADR.
*/
#define	DMA_SHADR062	(DMA_CH62_SHADR)

/** \brief  27F0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH63_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00127F0u)

/** Alias (User Manual Name) for DMA_CH63_ADICR.
* To use register names with standard convension, please use DMA_CH63_ADICR.
*/
#define	DMA_ADICR063	(DMA_CH63_ADICR)

/** \brief  27F4, DMA Channel Configuration Register */
#define DMA_CH63_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00127F4u)

/** Alias (User Manual Name) for DMA_CH63_CHCFGR.
* To use register names with standard convension, please use DMA_CH63_CHCFGR.
*/
#define	DMA_CHCFGR063	(DMA_CH63_CHCFGR)

/** \brief  27FC, DMARAM Channel Control and Status Register */
#define DMA_CH63_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00127FCu)

