feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_TSR39.
* To use register names with standard convension, please use DMA_TSR39.
*/
#define	DMA_TSR039	(DMA_TSR39)

/** \brief  1E10, DMA Transaction State Register */
#define DMA_TSR4 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E10u)

/** Alias (User Manual Name) for DMA_TSR4.
* To use register names with standard convension, please use DMA_TSR4.
*/
#define	DMA_TSR004	(DMA_TSR4)

/** \brief  1EA0, DMA Transaction State Register */
#define DMA_TSR40 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EA0u)

/** Alias (User Manual Name) for DMA_TSR40.
* To use register names with standard convension, please use DMA_TSR40.
*/
#define	DMA_TSR040	(DMA_TSR40)

/** \brief  1EA4, DMA Transaction State Register */
#define DMA_TSR41 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EA4u)

/** Alias (User Manual Name) for DMA_TSR41.
* To use register names with standard convension, please use DMA_TSR41.
*/
#define	DMA_TSR041	(DMA_TSR41)

/** \brief  1EA8, DMA Transaction State Register */
#define DMA_TSR42 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EA8u)

/** Alias (User Manual Name) for DMA_TSR42.
* To use register names with standard convension, please use DMA_TSR42.
*/
#define	DMA_TSR042	(DMA_TSR42)

/** \brief  1EAC, DMA Transaction State Register */
#define DMA_TSR43 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EACu)

/** Alias (User Manual Name) for DMA_TSR43.
* To use register names with standard convension, please use DMA_TSR43.
*/
#define	DMA_TSR043	(DMA_TSR43)

/** \brief  1EB0, DMA Transaction State Register */
#define DMA_TSR44 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EB0u)

/** Alias (User Manual Name) for DMA_TSR44.
* To use register names with standard convension, please use DMA_TSR44.
*/
#define	DMA_TSR044	(DMA_TSR44)

/** \brief  1EB4, DMA Transaction State Register */
#define DMA_TSR45 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EB4u)

/** Alias (User Manual Name) for DMA_TSR45.
* To use register names with standard convension, please use DMA_TSR45.
*/
#define	DMA_TSR045	(DMA_TSR45)

/** \brief  1EB8, DMA Transaction State Register */
#define DMA_TSR46 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EB8u)

/** Alias (User Manual Name) for DMA_TSR46.
* To use register names with standard convension, please use DMA_TSR46.
*/
#define	DMA_TSR046	(DMA_TSR46)

/** \brief  1EBC, DMA Transaction State Register */
#define DMA_TSR47 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EBCu)

/** Alias (User Manual Name) for DMA_TSR47.
* To use register names with standard convension, please use DMA_TSR47.
*/
#define	DMA_TSR047	(DMA_TSR47)

/** \brief  1EC0, DMA Transaction State Register */
#define DMA_TSR48 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EC0u)

/** Alias (User Manual Name) for DMA_TSR48.
* To use register names with standard convension, please use DMA_TSR48.
*/
#define	DMA_TSR048	(DMA_TSR48)

/** \brief  1EC4, DMA Transaction State Register */
#define DMA_TSR49 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EC4u)

/** Alias (User Manual Name) for DMA_TSR49.
* To use register names with standard convension, please use DMA_TSR49.
*/
#define	DMA_TSR049	(DMA_TSR49)

/** \brief  1E14, DMA Transaction State Register */
#define DMA_TSR5 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E14u)

/** Alias (User Manual Name) for DMA_TSR5.
* To use register names with standard convension, please use DMA_TSR5.
*/
#define	DMA_TSR005	(DMA_TSR5)

/** \brief  1EC8, DMA Transaction State Register */
#define DMA_TSR50 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EC8u)

/** Alias (User Manual Name) for DMA_TSR50.
* To use register names with standard convension, please use DMA_TSR50.
*/
#define	DMA_TSR050	(DMA_TSR50)

/** \brief  1ECC, DMA Transaction State Register */
#define DMA_TSR51 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011ECCu)

/** Alias (User Manual Name) for DMA_TSR51.
* To use register names with standard convension, please use DMA_TSR51.
*/
#define	DMA_TSR051	(DMA_TSR51)

/** \brief  1ED0, DMA Transaction State Register */
#define DMA_TSR52 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011ED0u)

/** Alias (User Manual Name) for DMA_TSR52.
* To use register names with standard convension, please use DMA_TSR52.
*/
#define	DMA_TSR052	(DMA_TSR52)

/** \brief  1ED4, DMA Transaction State Register */
#define DMA_TSR53 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011ED4u)

/** Alias (User Manual Name) for DMA_TSR53.
* To use register names with standard convension, please use DMA_TSR53.
*/
#define	DMA_TSR053	(DMA_TSR53)

/** \brief  1ED8, DMA Transaction State Register */
#define DMA_TSR54 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011ED8u)

/** Alias (User Manual Name) for DMA_TSR54.
* To use register names with standard convension, please use DMA_TSR54.
*/
#define	DMA_TSR054	(DMA_TSR54)

/** \brief  1EDC, DMA Transaction State Register */
#define DMA_TSR55 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EDCu)

/** Alias (User Manual Name) for DMA_TSR55.
* To use register names with standard convension, please use DMA_TSR55.
*/
#define	DMA_TSR055	(DMA_TSR55)

/** \brief  1EE0, DMA Transaction State Register */
#define DMA_TSR56 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EE0u)

/** Alias (User Manual Name) for DMA_TSR56.
* To use register names with standard convension, please use DMA_TSR56.
*/
#define	DMA_TSR056	(DMA_TSR56)

/** \brief  1EE4, DMA Transaction State Register */
#define DMA_TSR57 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EE4u)

/** Alias (User Manual Name) for DMA_TSR57.
* To use register names with standard convension, please use DMA_TSR57.
*/
#define	DMA_TSR057	(DMA_TSR57)

/** \brief  1EE8, DMA Transaction State Register */
#define DMA_TSR58 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EE8u)

/** Alias (User Manual Name) for DMA_TSR58.
* To use register names with standard convension, please use DMA_TSR58.
*/
#define	DMA_TSR058	(DMA_TSR58)

/** \brief  1EEC, DMA Transaction State Register */
#define DMA_TSR59 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EECu)

/** Alias (User Manual Name) for DMA_TSR59.
* To use register names with standard convension, please use DMA_TSR59.
*/
#define	DMA_TSR059	(DMA_TSR59)

